configuration/src/Catalogs/Мессенджеры/Мессенджеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мессенджеры</name>
  <predefined>
    <items>
      <name>Mattermost</name>
      <description>Mattermost</description>
    </items>
    <items>
      <name>RocketChat</name>
      <description>Rocket chat</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКартинкиВБиблиотеке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяИдентификатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/InformationRegisters/АдресаПолучателей/АдресаПолучателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресаПолучателей</name>
  <resources>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Мессенджер</name>
    <type>
      <types>CatalogRef.Мессенджеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>EnumRef.ТипыСлужебногоКанала</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Catalogs/Мессенджеры/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ДополнительныеСвойства.Свойство("Мессенджеры") Тогда 
		Для Каждого Мессенджер Из ДополнительныеСвойства.Мессенджеры Цикл 
			РегистрыСведений.АдресаПолучателей.Добавить(Мессенджер.Ссылка, Ссылка, Мессенджер.Адрес, Мессенджер.Идентификатор);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НастройкиПодключения") Тогда 
		УстановитьПривилегированныйРежим(Истина);
		Настройка = Справочники.Мессенджеры.ПолучитьНастройкуБезопасногоХранилища(Ссылка); 
		РегистрыСведений.БезопасноеХранилищеДанных.ПоместитьДанные(Настройка, 
			ДополнительныеСвойства.НастройкиПодключения);		
		УстановитьПривилегированныйРежим(Ложь);		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
